# def f(array):
#     dict = {i[0] * i[1]: i for i in array if i[0] != i[1]}
#     return max(dict.items())[1]

# orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3), (11, 11)]
# # orbits = [tuple(map(int, input().split())) for _ in range(int(input('Input qnt - ')))]

# print(*f(orbits))  # * - для того, чтобы убрать квадратные скобки



#   \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
# task 51

# Напишите функцию same_by(characteristic, objects),
# которая проверяет, все ли объекты имеют одинаковое
# значение некоторой характеристики, и возвращают True,
# если это так. Если значение характеристики для
# разных объектов отличается - то False.
# Для пустого набора объектов,
# функция должна возвращать True.
# Аргумент characteristic - это функция,
# которая принимает объект и вычисляет его характеристику.

# values = [0, 2, 10, 6]
